package ru.sayakhov.lesson4_loops.task1;

public class Taskone {
    public static void main(String[] args) {
/*          ● Написать программу для поиска минимального из 4 чисел введеных пользователем
            ● Написать программу, которая описывает введенное число. Отрицательное оно число или положительное (или нулевое), чётное или
        нечётное. Словами
            ● Написать программу для вывода на экран таблицы умножения.
            ● Написать программу, которая выводит арифметическую или геометрическую прогрессию для N чисел.*/
    }
}
